ARMmbed/mbed-os/features/FEATURE_BLE/targets/TARGET_NORDIC/TARGET_MCU_NRF51822/sdk/source/softdevice/s130/headers/ble_gap.h
/*
 * Copyright (c) Nordic Semiconductor ASA
 * All rights reserved.
 *
 * Redistribution and use in source and binary forms, with or without modification,
 * are permitted provided that the following conditions are met:
 *
 *   1. Redistributions of source code must retain the above copyright notice, this
 *   list of conditions and the following disclaimer.
 *
 *   2. Redistributions in binary form must reproduce the above copyright notice, this
 *   list of conditions and the following disclaimer in the documentation and/or
 *   other materials provided with the distribution.
 *
 *   3. Neither the name of Nordic Semiconductor ASA nor the names of other
 *   contributors to this software may be used to endorse or promote products
 *   derived from this software without specific prior written permission.
 *
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS" AND
 * ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED
 * WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
 * DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE FOR
 * ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES
 * (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES;
 * LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON
 * ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
 * (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS
 * SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 *
 */

/**
  @addtogroup BLE_GAP Generic Access Profile (GAP)
  @{
  @brief Definitions and prototypes for the GAP interface.
 */

#ifndef BLE_GAP_H__
#define BLE_GAP_H__

#include "ble_types.h"
#include "ble_ranges.h"
#include "nrf_svc.h"

/**@addtogroup BLE_GAP_ENUMERATIONS Enumerations
 * @{ */

/**@brief GAP API SVC numbers.
 */
enum BLE_GAP_SVCS {
    SD_BLE_GAP_ADDRESS_SET  = BLE_GAP_SVC_BASE,  /**< Set own Bluetooth Address. */
    SD_BLE_GAP_ADDRESS_GET,                      /**< Get own Bluetooth Address. */
    SD_BLE_GAP_ADV_DATA_SET,                     /**< Set Advertising Data. */
    SD_BLE_GAP_ADV_START,                        /**< Start Advertising. */
    SD_BLE_GAP_ADV_STOP,                         /**< Stop Advertising. */
    SD_BLE_GAP_CONN_PARAM_UPDATE,                /**< Connection Parameter Update. */
    SD_BLE_GAP_DISCONNECT,                       /**< Disconnect. */
    SD_BLE_GAP_TX_POWER_SET,                     /**< Set TX Power. */
    SD_BLE_GAP_APPEARANCE_SET,                   /**< Set Appearance. */
    SD_BLE_GAP_APPEARANCE_GET,                   /**< Get Appearance. */
    SD_BLE_GAP_PPCP_SET,                         /**< Set PPCP. */
    SD_BLE_GAP_PPCP_GET,                         /**< Get PPCP. */
    SD_BLE_GAP_DEVICE_NAME_SET,                  /**< Set Device Name. */
    SD_BLE_GAP_DEVICE_NAME_GET,                  /**< Get Device Name. */
    SD_BLE_GAP_AUTHENTICATE,                     /**< Initiate Pairing/Bonding. */
    SD_BLE_GAP_SEC_PARAMS_REPLY,                 /**< Reply with Security Parameters. */
    SD_BLE_GAP_AUTH_KEY_REPLY,                   /**< Reply with an authentication key. */
    SD_BLE_GAP_ENCRYPT,                          /**< Initiate encryption procedure. */
    SD_BLE_GAP_SEC_INFO_REPLY,                   /**< Reply with Security Information. */
    SD_BLE_GAP_CONN_SEC_GET,                     /**< Obtain connection security level. */
    SD_BLE_GAP_RSSI_START,                       /**< Start reporting of changes in RSSI. */
    SD_BLE_GAP_RSSI_STOP,                        /**< Stop reporting of changes in RSSI. */
    SD_BLE_GAP_SCAN_START,                       /**< Start Scanning. */
    SD_BLE_GAP_SCAN_STOP,                        /**< Stop Scanning. */
    SD_BLE_GAP_CONNECT,                          /**< Connect. */
    SD_BLE_GAP_CONNECT_CANCEL,                   /**< Cancel ongoing connection procedure. */
    SD_BLE_GAP_RSSI_GET,                         /**< Get the last RSSI sample. */
};

/**@brief GAP Event IDs.
 * IDs that uniquely identify an event coming from the stack to the application.
 */
enum BLE_GAP_EVTS {
    BLE_GAP_EVT_CONNECTED  = BLE_GAP_EVT_BASE,    /**< Connection established. @ref ble_gap_evt_connected_t */
    BLE_GAP_EVT_DISCONNECTED,                     /**< Disconnected from peer. @ref ble_gap_evt_disconnected_t */
    BLE_GAP_EVT_CONN_PARAM_UPDATE,                /**< Connection Parameters updated. ble_gap_evt_conn_param_update_t */
    BLE_GAP_EVT_SEC_PARAMS_REQUEST,               /**< Request to provide security parameters. @ref ble_gap_evt_sec_params_request_t */
    BLE_GAP_EVT_SEC_INFO_REQUEST,                 /**< Request to provide security information. @ref ble_gap_evt_sec_info_request_t */
    BLE_GAP_EVT_PASSKEY_DISPLAY,                  /**< Request to display a passkey to the user. @ref ble_gap_evt_passkey_display_t */
    BLE_GAP_EVT_AUTH_KEY_REQUEST,                 /**< Request to provide an authentication key. @ref ble_gap_evt_auth_key_request_t */
    BLE_GAP_EVT_AUTH_STATUS,                      /**< Authentication procedure completed with status. @ref ble_gap_evt_auth_status_t */
    BLE_GAP_EVT_CONN_SEC_UPDATE,                  /**< Connection security updated. @ref ble_gap_evt_conn_sec_update_t */
    BLE_GAP_EVT_TIMEOUT,                          /**< Timeout expired. @ref ble_gap_evt_timeout_t */
    BLE_GAP_EVT_RSSI_CHANGED,                     /**< RSSI report. @ref ble_gap_evt_rssi_changed_t */
    BLE_GAP_EVT_ADV_REPORT,                       /**< Advertising report. @ref ble_gap_evt_adv_report_t */
    BLE_GAP_EVT_SEC_REQUEST,                      /**< Security Request. @ref ble_gap_evt_sec_request_t */
    BLE_GAP_EVT_CONN_PARAM_UPDATE_REQUEST,        /**< Connection Parameter Update Request. @ref ble_gap_evt_conn_param_update_request_t */
    BLE_GAP_EVT_SCAN_REQ_REPORT,                  /**< Scan request report. @ref ble_gap_evt_scan_req_report_t */
};

